tests/loadtest/results/20260617_104413_capacity_working_k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /tests/ecg_scenario.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 30m30s max duration (incl. graceful stop):
              * ecg: 100 iterations shared among 5 VUs (maxDuration: 30m0s, gracefulStop: 30s)


Run    [ 100% ] setup()
ecg    [   0% ]

Run    [ 100% ] setup()
ecg    [   0% ]

running (00m03.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 5 VUs  00m00.5s/30m0s  000/100 shared iters

running (00m04.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 5 VUs  00m01.5s/30m0s  000/100 shared iters

running (00m05.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 5 VUs  00m02.5s/30m0s  000/100 shared iters

running (00m06.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 5 VUs  00m03.5s/30m0s  000/100 shared iters

running (00m07.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 5 VUs  00m04.5s/30m0s  000/100 shared iters

running (00m08.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 5 VUs  00m05.5s/30m0s  000/100 shared iters

running (00m09.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 5 VUs  00m06.5s/30m0s  000/100 shared iters

running (00m10.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 5 VUs  00m07.5s/30m0s  000/100 shared iters

running (00m11.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 5 VUs  00m08.5s/30m0s  000/100 shared iters

running (00m12.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 5 VUs  00m09.5s/30m0s  000/100 shared iters

running (00m13.0s), 5/5 VUs, 1 complete and 0 interrupted iterations
ecg    [   1% ] 5 VUs  00m10.5s/30m0s  001/100 shared iters

running (00m14.0s), 5/5 VUs, 1 complete and 0 interrupted iterations
ecg    [   1% ] 5 VUs  00m11.5s/30m0s  001/100 shared iters

running (00m15.0s), 5/5 VUs, 2 complete and 0 interrupted iterations
ecg    [   2% ] 5 VUs  00m12.5s/30m0s  002/100 shared iters

running (00m16.0s), 5/5 VUs, 2 complete and 0 interrupted iterations
ecg    [   2% ] 5 VUs  00m13.5s/30m0s  002/100 shared iters

running (00m17.0s), 5/5 VUs, 2 complete and 0 interrupted iterations
ecg    [   2% ] 5 VUs  00m14.5s/30m0s  002/100 shared iters

running (00m18.0s), 5/5 VUs, 2 complete and 0 interrupted iterations
ecg    [   2% ] 5 VUs  00m15.5s/30m0s  002/100 shared iters

running (00m19.0s), 5/5 VUs, 3 complete and 0 interrupted iterations
ecg    [   3% ] 5 VUs  00m16.5s/30m0s  003/100 shared iters

running (00m20.0s), 5/5 VUs, 3 complete and 0 interrupted iterations
ecg    [   3% ] 5 VUs  00m17.5s/30m0s  003/100 shared iters

running (00m21.0s), 5/5 VUs, 4 complete and 0 interrupted iterations
ecg    [   4% ] 5 VUs  00m18.5s/30m0s  004/100 shared iters

running (00m22.0s), 5/5 VUs, 4 complete and 0 interrupted iterations
ecg    [   4% ] 5 VUs  00m19.5s/30m0s  004/100 shared iters

running (00m23.0s), 5/5 VUs, 4 complete and 0 interrupted iterations
ecg    [   4% ] 5 VUs  00m20.5s/30m0s  004/100 shared iters

running (00m24.0s), 5/5 VUs, 4 complete and 0 interrupted iterations
ecg    [   4% ] 5 VUs  00m21.5s/30m0s  004/100 shared iters

running (00m25.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
ecg    [   5% ] 5 VUs  00m22.5s/30m0s  005/100 shared iters

running (00m26.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
ecg    [   5% ] 5 VUs  00m23.5s/30m0s  005/100 shared iters

running (00m27.0s), 5/5 VUs, 6 complete and 0 interrupted iterations
ecg    [   6% ] 5 VUs  00m24.5s/30m0s  006/100 shared iters

running (00m28.0s), 5/5 VUs, 6 complete and 0 interrupted iterations
ecg    [   6% ] 5 VUs  00m25.5s/30m0s  006/100 shared iters

running (00m29.0s), 5/5 VUs, 6 complete and 0 interrupted iterations
ecg    [   6% ] 5 VUs  00m26.5s/30m0s  006/100 shared iters

running (00m30.0s), 5/5 VUs, 6 complete and 0 interrupted iterations
ecg    [   6% ] 5 VUs  00m27.5s/30m0s  006/100 shared iters

running (00m31.0s), 5/5 VUs, 7 complete and 0 interrupted iterations
ecg    [   7% ] 5 VUs  00m28.5s/30m0s  007/100 shared iters

running (00m32.0s), 5/5 VUs, 7 complete and 0 interrupted iterations
ecg    [   7% ] 5 VUs  00m29.5s/30m0s  007/100 shared iters

running (00m33.0s), 5/5 VUs, 7 complete and 0 interrupted iterations
ecg    [   7% ] 5 VUs  00m30.5s/30m0s  007/100 shared iters

running (00m34.0s), 5/5 VUs, 7 complete and 0 interrupted iterations
ecg    [   7% ] 5 VUs  00m31.5s/30m0s  007/100 shared iters

running (00m35.0s), 5/5 VUs, 8 complete and 0 interrupted iterations
ecg    [   8% ] 5 VUs  00m32.5s/30m0s  008/100 shared iters

running (00m36.0s), 5/5 VUs, 8 complete and 0 interrupted iterations
ecg    [   8% ] 5 VUs  00m33.5s/30m0s  008/100 shared iters

running (00m37.0s), 5/5 VUs, 9 complete and 0 interrupted iterations
ecg    [   9% ] 5 VUs  00m34.5s/30m0s  009/100 shared iters

running (00m38.0s), 5/5 VUs, 9 complete and 0 interrupted iterations
ecg    [   9% ] 5 VUs  00m35.5s/30m0s  009/100 shared iters

running (00m39.0s), 5/5 VUs, 9 complete and 0 interrupted iterations
ecg    [   9% ] 5 VUs  00m36.5s/30m0s  009/100 shared iters

running (00m40.0s), 5/5 VUs, 9 complete and 0 interrupted iterations
ecg    [   9% ] 5 VUs  00m37.5s/30m0s  009/100 shared iters

running (00m41.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
ecg    [  10% ] 5 VUs  00m38.5s/30m0s  010/100 shared iters

running (00m42.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
ecg    [  10% ] 5 VUs  00m39.5s/30m0s  010/100 shared iters

running (00m43.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
ecg    [  10% ] 5 VUs  00m40.5s/30m0s  010/100 shared iters

running (00m44.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
ecg    [  10% ] 5 VUs  00m41.5s/30m0s  010/100 shared iters

running (00m45.0s), 5/5 VUs, 11 complete and 0 interrupted iterations
ecg    [  11% ] 5 VUs  00m42.5s/30m0s  011/100 shared iters

running (00m46.0s), 5/5 VUs, 11 complete and 0 interrupted iterations
ecg    [  11% ] 5 VUs  00m43.5s/30m0s  011/100 shared iters

running (00m47.0s), 5/5 VUs, 12 complete and 0 interrupted iterations
ecg    [  12% ] 5 VUs  00m44.5s/30m0s  012/100 shared iters

running (00m48.0s), 5/5 VUs, 12 complete and 0 interrupted iterations
ecg    [  12% ] 5 VUs  00m45.5s/30m0s  012/100 shared iters

running (00m49.0s), 5/5 VUs, 12 complete and 0 interrupted iterations
ecg    [  12% ] 5 VUs  00m46.5s/30m0s  012/100 shared iters

running (00m50.0s), 5/5 VUs, 12 complete and 0 interrupted iterations
ecg    [  12% ] 5 VUs  00m47.5s/30m0s  012/100 shared iters

running (00m51.0s), 5/5 VUs, 13 complete and 0 interrupted iterations
ecg    [  13% ] 5 VUs  00m48.5s/30m0s  013/100 shared iters

running (00m52.0s), 5/5 VUs, 13 complete and 0 interrupted iterations
ecg    [  13% ] 5 VUs  00m49.5s/30m0s  013/100 shared iters

running (00m53.0s), 5/5 VUs, 14 complete and 0 interrupted iterations
ecg    [  14% ] 5 VUs  00m50.5s/30m0s  014/100 shared iters

running (00m54.0s), 5/5 VUs, 14 complete and 0 interrupted iterations
ecg    [  14% ] 5 VUs  00m51.5s/30m0s  014/100 shared iters

running (00m55.0s), 5/5 VUs, 14 complete and 0 interrupted iterations
ecg    [  14% ] 5 VUs  00m52.5s/30m0s  014/100 shared iters

running (00m56.0s), 5/5 VUs, 14 complete and 0 interrupted iterations
ecg    [  14% ] 5 VUs  00m53.5s/30m0s  014/100 shared iters

running (00m57.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
ecg    [  15% ] 5 VUs  00m54.5s/30m0s  015/100 shared iters

running (00m58.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
ecg    [  15% ] 5 VUs  00m55.5s/30m0s  015/100 shared iters

running (00m59.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
ecg    [  15% ] 5 VUs  00m56.5s/30m0s  015/100 shared iters

running (01m00.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
ecg    [  15% ] 5 VUs  00m57.5s/30m0s  015/100 shared iters

running (01m01.0s), 5/5 VUs, 16 complete and 0 interrupted iterations
ecg    [  16% ] 5 VUs  00m58.5s/30m0s  016/100 shared iters

running (01m02.0s), 5/5 VUs, 16 complete and 0 interrupted iterations
ecg    [  16% ] 5 VUs  00m59.5s/30m0s  016/100 shared iters

running (01m03.0s), 5/5 VUs, 17 complete and 0 interrupted iterations
ecg    [  17% ] 5 VUs  01m00.5s/30m0s  017/100 shared iters

running (01m04.0s), 5/5 VUs, 17 complete and 0 interrupted iterations
ecg    [  17% ] 5 VUs  01m01.5s/30m0s  017/100 shared iters

running (01m05.0s), 5/5 VUs, 17 complete and 0 interrupted iterations
ecg    [  17% ] 5 VUs  01m02.5s/30m0s  017/100 shared iters

running (01m06.0s), 5/5 VUs, 17 complete and 0 interrupted iterations
ecg    [  17% ] 5 VUs  01m03.5s/30m0s  017/100 shared iters

running (01m07.0s), 5/5 VUs, 18 complete and 0 interrupted iterations
ecg    [  18% ] 5 VUs  01m04.5s/30m0s  018/100 shared iters

running (01m08.0s), 5/5 VUs, 18 complete and 0 interrupted iterations
ecg    [  18% ] 5 VUs  01m05.5s/30m0s  018/100 shared iters

running (01m09.0s), 5/5 VUs, 18 complete and 0 interrupted iterations
ecg    [  18% ] 5 VUs  01m06.5s/30m0s  018/100 shared iters

running (01m10.0s), 5/5 VUs, 18 complete and 0 interrupted iterations
ecg    [  18% ] 5 VUs  01m07.5s/30m0s  018/100 shared iters

running (01m11.0s), 5/5 VUs, 19 complete and 0 interrupted iterations
ecg    [  19% ] 5 VUs  01m08.5s/30m0s  019/100 shared iters

running (01m12.0s), 5/5 VUs, 19 complete and 0 interrupted iterations
ecg    [  19% ] 5 VUs  01m09.5s/30m0s  019/100 shared iters

running (01m13.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
ecg    [  20% ] 5 VUs  01m10.5s/30m0s  020/100 shared iters

running (01m14.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
ecg    [  20% ] 5 VUs  01m11.5s/30m0s  020/100 shared iters

running (01m15.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
ecg    [  20% ] 5 VUs  01m12.5s/30m0s  020/100 shared iters

running (01m16.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
ecg    [  20% ] 5 VUs  01m13.5s/30m0s  020/100 shared iters

running (01m17.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
ecg    [  21% ] 5 VUs  01m14.5s/30m0s  021/100 shared iters

running (01m18.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
ecg    [  21% ] 5 VUs  01m15.5s/30m0s  021/100 shared iters

running (01m19.0s), 5/5 VUs, 22 complete and 0 interrupted iterations
ecg    [  22% ] 5 VUs  01m16.5s/30m0s  022/100 shared iters

running (01m20.0s), 5/5 VUs, 22 complete and 0 interrupted iterations
ecg    [  22% ] 5 VUs  01m17.5s/30m0s  022/100 shared iters

running (01m21.0s), 5/5 VUs, 22 complete and 0 interrupted iterations
ecg    [  22% ] 5 VUs  01m18.5s/30m0s  022/100 shared iters

running (01m22.0s), 5/5 VUs, 22 complete and 0 interrupted iterations
ecg    [  22% ] 5 VUs  01m19.5s/30m0s  022/100 shared iters

running (01m23.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
ecg    [  23% ] 5 VUs  01m20.5s/30m0s  023/100 shared iters

running (01m24.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
ecg    [  23% ] 5 VUs  01m21.5s/30m0s  023/100 shared iters

running (01m25.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
ecg    [  24% ] 5 VUs  01m22.5s/30m0s  024/100 shared iters

running (01m26.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
ecg    [  24% ] 5 VUs  01m23.5s/30m0s  024/100 shared iters

running (01m27.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
ecg    [  24% ] 5 VUs  01m24.5s/30m0s  024/100 shared iters

running (01m28.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
ecg    [  24% ] 5 VUs  01m25.5s/30m0s  024/100 shared iters

running (01m29.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
ecg    [  25% ] 5 VUs  01m26.5s/30m0s  025/100 shared iters

running (01m30.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
ecg    [  25% ] 5 VUs  01m27.5s/30m0s  025/100 shared iters

running (01m31.0s), 5/5 VUs, 26 complete and 0 interrupted iterations
ecg    [  26% ] 5 VUs  01m28.5s/30m0s  026/100 shared iters

running (01m32.0s), 5/5 VUs, 26 complete and 0 interrupted iterations
ecg    [  26% ] 5 VUs  01m29.5s/30m0s  026/100 shared iters

running (01m33.0s), 5/5 VUs, 26 complete and 0 interrupted iterations
ecg    [  26% ] 5 VUs  01m30.5s/30m0s  026/100 shared iters

running (01m34.0s), 5/5 VUs, 26 complete and 0 interrupted iterations
ecg    [  26% ] 5 VUs  01m31.5s/30m0s  026/100 shared iters

running (01m35.0s), 5/5 VUs, 27 complete and 0 interrupted iterations
ecg    [  27% ] 5 VUs  01m32.5s/30m0s  027/100 shared iters

running (01m36.0s), 5/5 VUs, 27 complete and 0 interrupted iterations
ecg    [  27% ] 5 VUs  01m33.5s/30m0s  027/100 shared iters

running (01m37.0s), 5/5 VUs, 27 complete and 0 interrupted iterations
ecg    [  27% ] 5 VUs  01m34.5s/30m0s  027/100 shared iters

running (01m38.0s), 5/5 VUs, 27 complete and 0 interrupted iterations
ecg    [  27% ] 5 VUs  01m35.5s/30m0s  027/100 shared iters

running (01m39.0s), 5/5 VUs, 28 complete and 0 interrupted iterations
ecg    [  28% ] 5 VUs  01m36.5s/30m0s  028/100 shared iters

running (01m40.0s), 5/5 VUs, 28 complete and 0 interrupted iterations
ecg    [  28% ] 5 VUs  01m37.5s/30m0s  028/100 shared iters

running (01m41.0s), 5/5 VUs, 28 complete and 0 interrupted iterations
ecg    [  28% ] 5 VUs  01m38.5s/30m0s  028/100 shared iters

running (01m42.0s), 5/5 VUs, 28 complete and 0 interrupted iterations
ecg    [  28% ] 5 VUs  01m39.5s/30m0s  028/100 shared iters

running (01m43.0s), 5/5 VUs, 29 complete and 0 interrupted iterations
ecg    [  29% ] 5 VUs  01m40.5s/30m0s  029/100 shared iters

running (01m44.0s), 5/5 VUs, 29 complete and 0 interrupted iterations
ecg    [  29% ] 5 VUs  01m41.5s/30m0s  029/100 shared iters

running (01m45.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
ecg    [  30% ] 5 VUs  01m42.5s/30m0s  030/100 shared iters

running (01m46.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
ecg    [  30% ] 5 VUs  01m43.5s/30m0s  030/100 shared iters

running (01m47.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
ecg    [  30% ] 5 VUs  01m44.5s/30m0s  030/100 shared iters

running (01m48.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
ecg    [  30% ] 5 VUs  01m45.5s/30m0s  030/100 shared iters

running (01m49.0s), 5/5 VUs, 31 complete and 0 interrupted iterations
ecg    [  31% ] 5 VUs  01m46.5s/30m0s  031/100 shared iters

running (01m50.0s), 5/5 VUs, 31 complete and 0 interrupted iterations
ecg    [  31% ] 5 VUs  01m47.5s/30m0s  031/100 shared iters

running (01m51.0s), 5/5 VUs, 32 complete and 0 interrupted iterations
ecg    [  32% ] 5 VUs  01m48.5s/30m0s  032/100 shared iters

running (01m52.0s), 5/5 VUs, 32 complete and 0 interrupted iterations
ecg    [  32% ] 5 VUs  01m49.5s/30m0s  032/100 shared iters

running (01m53.0s), 5/5 VUs, 32 complete and 0 interrupted iterations
ecg    [  32% ] 5 VUs  01m50.5s/30m0s  032/100 shared iters

running (01m54.0s), 5/5 VUs, 32 complete and 0 interrupted iterations
ecg    [  32% ] 5 VUs  01m51.5s/30m0s  032/100 shared iters

running (01m55.0s), 5/5 VUs, 33 complete and 0 interrupted iterations
ecg    [  33% ] 5 VUs  01m52.5s/30m0s  033/100 shared iters

running (01m56.0s), 5/5 VUs, 33 complete and 0 interrupted iterations
ecg    [  33% ] 5 VUs  01m53.5s/30m0s  033/100 shared iters

running (01m57.0s), 5/5 VUs, 33 complete and 0 interrupted iterations
ecg    [  33% ] 5 VUs  01m54.5s/30m0s  033/100 shared iters

running (01m58.0s), 5/5 VUs, 33 complete and 0 interrupted iterations
ecg    [  33% ] 5 VUs  01m55.5s/30m0s  033/100 shared iters

running (01m59.0s), 5/5 VUs, 34 complete and 0 interrupted iterations
ecg    [  34% ] 5 VUs  01m56.5s/30m0s  034/100 shared iters

running (02m00.0s), 5/5 VUs, 34 complete and 0 interrupted iterations
ecg    [  34% ] 5 VUs  01m57.5s/30m0s  034/100 shared iters

running (02m01.0s), 5/5 VUs, 34 complete and 0 interrupted iterations
ecg    [  34% ] 5 VUs  01m58.5s/30m0s  034/100 shared iters

running (02m02.0s), 5/5 VUs, 34 complete and 0 interrupted iterations
ecg    [  34% ] 5 VUs  01m59.5s/30m0s  034/100 shared iters

running (02m03.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
ecg    [  35% ] 5 VUs  02m00.5s/30m0s  035/100 shared iters

running (02m04.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
ecg    [  35% ] 5 VUs  02m01.5s/30m0s  035/100 shared iters

running (02m05.0s), 5/5 VUs, 36 complete and 0 interrupted iterations
ecg    [  36% ] 5 VUs  02m02.5s/30m0s  036/100 shared iters

running (02m06.0s), 5/5 VUs, 36 complete and 0 interrupted iterations
ecg    [  36% ] 5 VUs  02m03.5s/30m0s  036/100 shared iters

running (02m07.0s), 5/5 VUs, 36 complete and 0 interrupted iterations
ecg    [  36% ] 5 VUs  02m04.5s/30m0s  036/100 shared iters

running (02m08.0s), 5/5 VUs, 36 complete and 0 interrupted iterations
ecg    [  36% ] 5 VUs  02m05.5s/30m0s  036/100 shared iters

running (02m09.0s), 5/5 VUs, 37 complete and 0 interrupted iterations
ecg    [  37% ] 5 VUs  02m06.5s/30m0s  037/100 shared iters

running (02m10.0s), 5/5 VUs, 37 complete and 0 interrupted iterations
ecg    [  37% ] 5 VUs  02m07.5s/30m0s  037/100 shared iters

running (02m11.0s), 5/5 VUs, 38 complete and 0 interrupted iterations
ecg    [  38% ] 5 VUs  02m08.5s/30m0s  038/100 shared iters

running (02m12.0s), 5/5 VUs, 38 complete and 0 interrupted iterations
ecg    [  38% ] 5 VUs  02m09.5s/30m0s  038/100 shared iters

running (02m13.0s), 5/5 VUs, 38 complete and 0 interrupted iterations
ecg    [  38% ] 5 VUs  02m10.5s/30m0s  038/100 shared iters

running (02m14.0s), 5/5 VUs, 38 complete and 0 interrupted iterations
ecg    [  38% ] 5 VUs  02m11.5s/30m0s  038/100 shared iters

running (02m15.0s), 5/5 VUs, 39 complete and 0 interrupted iterations
ecg    [  39% ] 5 VUs  02m12.5s/30m0s  039/100 shared iters

running (02m16.0s), 5/5 VUs, 39 complete and 0 interrupted iterations
ecg    [  39% ] 5 VUs  02m13.5s/30m0s  039/100 shared iters

running (02m17.0s), 5/5 VUs, 39 complete and 0 interrupted iterations
ecg    [  39% ] 5 VUs  02m14.5s/30m0s  039/100 shared iters

running (02m18.0s), 5/5 VUs, 39 complete and 0 interrupted iterations
ecg    [  39% ] 5 VUs  02m15.5s/30m0s  039/100 shared iters

running (02m19.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
ecg    [  40% ] 5 VUs  02m16.5s/30m0s  040/100 shared iters

running (02m20.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
ecg    [  40% ] 5 VUs  02m17.5s/30m0s  040/100 shared iters

running (02m21.0s), 5/5 VUs, 41 complete and 0 interrupted iterations
ecg    [  41% ] 5 VUs  02m18.5s/30m0s  041/100 shared iters

running (02m22.0s), 5/5 VUs, 41 complete and 0 interrupted iterations
ecg    [  41% ] 5 VUs  02m19.5s/30m0s  041/100 shared iters

running (02m23.0s), 5/5 VUs, 41 complete and 0 interrupted iterations
ecg    [  41% ] 5 VUs  02m20.5s/30m0s  041/100 shared iters

running (02m24.0s), 5/5 VUs, 41 complete and 0 interrupted iterations
ecg    [  41% ] 5 VUs  02m21.5s/30m0s  041/100 shared iters

running (02m25.0s), 5/5 VUs, 42 complete and 0 interrupted iterations
ecg    [  42% ] 5 VUs  02m22.5s/30m0s  042/100 shared iters

running (02m26.0s), 5/5 VUs, 42 complete and 0 interrupted iterations
ecg    [  42% ] 5 VUs  02m23.5s/30m0s  042/100 shared iters

running (02m27.0s), 5/5 VUs, 42 complete and 0 interrupted iterations
ecg    [  42% ] 5 VUs  02m24.5s/30m0s  042/100 shared iters

running (02m28.0s), 5/5 VUs, 42 complete and 0 interrupted iterations
ecg    [  42% ] 5 VUs  02m25.5s/30m0s  042/100 shared iters

running (02m29.0s), 5/5 VUs, 43 complete and 0 interrupted iterations
ecg    [  43% ] 5 VUs  02m26.5s/30m0s  043/100 shared iters

running (02m30.0s), 5/5 VUs, 43 complete and 0 interrupted iterations
ecg    [  43% ] 5 VUs  02m27.5s/30m0s  043/100 shared iters

running (02m31.0s), 5/5 VUs, 44 complete and 0 interrupted iterations
ecg    [  44% ] 5 VUs  02m28.5s/30m0s  044/100 shared iters

running (02m32.0s), 5/5 VUs, 44 complete and 0 interrupted iterations
ecg    [  44% ] 5 VUs  02m29.5s/30m0s  044/100 shared iters

running (02m33.0s), 5/5 VUs, 44 complete and 0 interrupted iterations
ecg    [  44% ] 5 VUs  02m30.5s/30m0s  044/100 shared iters

running (02m34.0s), 5/5 VUs, 44 complete and 0 interrupted iterations
ecg    [  44% ] 5 VUs  02m31.5s/30m0s  044/100 shared iters

running (02m35.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
ecg    [  45% ] 5 VUs  02m32.5s/30m0s  045/100 shared iters

running (02m36.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
ecg    [  45% ] 5 VUs  02m33.5s/30m0s  045/100 shared iters

running (02m37.0s), 5/5 VUs, 46 complete and 0 interrupted iterations
ecg    [  46% ] 5 VUs  02m34.5s/30m0s  046/100 shared iters

running (02m38.0s), 5/5 VUs, 46 complete and 0 interrupted iterations
ecg    [  46% ] 5 VUs  02m35.5s/30m0s  046/100 shared iters

running (02m39.0s), 5/5 VUs, 46 complete and 0 interrupted iterations
ecg    [  46% ] 5 VUs  02m36.5s/30m0s  046/100 shared iters

running (02m40.0s), 5/5 VUs, 46 complete and 0 interrupted iterations
ecg    [  46% ] 5 VUs  02m37.5s/30m0s  046/100 shared iters

running (02m41.0s), 5/5 VUs, 47 complete and 0 interrupted iterations
ecg    [  47% ] 5 VUs  02m38.5s/30m0s  047/100 shared iters

running (02m42.0s), 5/5 VUs, 47 complete and 0 interrupted iterations
ecg    [  47% ] 5 VUs  02m39.5s/30m0s  047/100 shared iters

running (02m43.0s), 5/5 VUs, 47 complete and 0 interrupted iterations
ecg    [  47% ] 5 VUs  02m40.5s/30m0s  047/100 shared iters

running (02m44.0s), 5/5 VUs, 48 complete and 0 interrupted iterations
ecg    [  48% ] 5 VUs  02m41.5s/30m0s  048/100 shared iters

running (02m45.0s), 5/5 VUs, 48 complete and 0 interrupted iterations
ecg    [  48% ] 5 VUs  02m42.5s/30m0s  048/100 shared iters

running (02m46.0s), 5/5 VUs, 48 complete and 0 interrupted iterations
ecg    [  48% ] 5 VUs  02m43.5s/30m0s  048/100 shared iters

running (02m47.0s), 5/5 VUs, 48 complete and 0 interrupted iterations
ecg    [  48% ] 5 VUs  02m44.5s/30m0s  048/100 shared iters

running (02m48.0s), 5/5 VUs, 49 complete and 0 interrupted iterations
ecg    [  49% ] 5 VUs  02m45.5s/30m0s  049/100 shared iters

running (02m49.0s), 5/5 VUs, 49 complete and 0 interrupted iterations
ecg    [  49% ] 5 VUs  02m46.5s/30m0s  049/100 shared iters

running (02m50.0s), 5/5 VUs, 49 complete and 0 interrupted iterations
ecg    [  49% ] 5 VUs  02m47.5s/30m0s  049/100 shared iters

running (02m51.0s), 5/5 VUs, 49 complete and 0 interrupted iterations
ecg    [  49% ] 5 VUs  02m48.5s/30m0s  049/100 shared iters

running (02m52.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
ecg    [  50% ] 5 VUs  02m49.5s/30m0s  050/100 shared iters

running (02m53.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
ecg    [  50% ] 5 VUs  02m50.5s/30m0s  050/100 shared iters

running (02m54.0s), 5/5 VUs, 51 complete and 0 interrupted iterations
ecg    [  51% ] 5 VUs  02m51.5s/30m0s  051/100 shared iters

running (02m55.0s), 5/5 VUs, 51 complete and 0 interrupted iterations
ecg    [  51% ] 5 VUs  02m52.5s/30m0s  051/100 shared iters

running (02m56.0s), 5/5 VUs, 51 complete and 0 interrupted iterations
ecg    [  51% ] 5 VUs  02m53.5s/30m0s  051/100 shared iters

running (02m57.0s), 5/5 VUs, 51 complete and 0 interrupted iterations
ecg    [  51% ] 5 VUs  02m54.5s/30m0s  051/100 shared iters

running (02m58.0s), 5/5 VUs, 52 complete and 0 interrupted iterations
ecg    [  52% ] 5 VUs  02m55.5s/30m0s  052/100 shared iters

running (02m59.0s), 5/5 VUs, 52 complete and 0 interrupted iterations
ecg    [  52% ] 5 VUs  02m56.5s/30m0s  052/100 shared iters

running (03m00.0s), 5/5 VUs, 53 complete and 0 interrupted iterations
ecg    [  53% ] 5 VUs  02m57.5s/30m0s  053/100 shared iters

running (03m01.0s), 5/5 VUs, 53 complete and 0 interrupted iterations
ecg    [  53% ] 5 VUs  02m58.5s/30m0s  053/100 shared iters

running (03m02.0s), 5/5 VUs, 53 complete and 0 interrupted iterations
ecg    [  53% ] 5 VUs  02m59.5s/30m0s  053/100 shared iters

running (03m03.0s), 5/5 VUs, 53 complete and 0 interrupted iterations
ecg    [  53% ] 5 VUs  03m00.5s/30m0s  053/100 shared iters

running (03m04.0s), 5/5 VUs, 54 complete and 0 interrupted iterations
ecg    [  54% ] 5 VUs  03m01.5s/30m0s  054/100 shared iters

running (03m05.0s), 5/5 VUs, 54 complete and 0 interrupted iterations
ecg    [  54% ] 5 VUs  03m02.5s/30m0s  054/100 shared iters

running (03m06.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
ecg    [  55% ] 5 VUs  03m03.5s/30m0s  055/100 shared iters

running (03m07.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
ecg    [  55% ] 5 VUs  03m04.5s/30m0s  055/100 shared iters

running (03m08.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
ecg    [  55% ] 5 VUs  03m05.5s/30m0s  055/100 shared iters

running (03m09.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
ecg    [  55% ] 5 VUs  03m06.5s/30m0s  055/100 shared iters

running (03m10.0s), 5/5 VUs, 56 complete and 0 interrupted iterations
ecg    [  56% ] 5 VUs  03m07.5s/30m0s  056/100 shared iters

running (03m11.0s), 5/5 VUs, 56 complete and 0 interrupted iterations
ecg    [  56% ] 5 VUs  03m08.5s/30m0s  056/100 shared iters

running (03m12.0s), 5/5 VUs, 56 complete and 0 interrupted iterations
ecg    [  56% ] 5 VUs  03m09.5s/30m0s  056/100 shared iters

running (03m13.0s), 5/5 VUs, 56 complete and 0 interrupted iterations
ecg    [  56% ] 5 VUs  03m10.5s/30m0s  056/100 shared iters

running (03m14.0s), 5/5 VUs, 57 complete and 0 interrupted iterations
ecg    [  57% ] 5 VUs  03m11.5s/30m0s  057/100 shared iters

running (03m15.0s), 5/5 VUs, 57 complete and 0 interrupted iterations
ecg    [  57% ] 5 VUs  03m12.5s/30m0s  057/100 shared iters

running (03m16.0s), 5/5 VUs, 58 complete and 0 interrupted iterations
ecg    [  58% ] 5 VUs  03m13.5s/30m0s  058/100 shared iters

running (03m17.0s), 5/5 VUs, 58 complete and 0 interrupted iterations
ecg    [  58% ] 5 VUs  03m14.5s/30m0s  058/100 shared iters

running (03m18.0s), 5/5 VUs, 58 complete and 0 interrupted iterations
ecg    [  58% ] 5 VUs  03m15.5s/30m0s  058/100 shared iters

running (03m19.0s), 5/5 VUs, 58 complete and 0 interrupted iterations
ecg    [  58% ] 5 VUs  03m16.5s/30m0s  058/100 shared iters

running (03m20.0s), 5/5 VUs, 59 complete and 0 interrupted iterations
ecg    [  59% ] 5 VUs  03m17.5s/30m0s  059/100 shared iters

running (03m21.0s), 5/5 VUs, 59 complete and 0 interrupted iterations
ecg    [  59% ] 5 VUs  03m18.5s/30m0s  059/100 shared iters

running (03m22.0s), 5/5 VUs, 59 complete and 0 interrupted iterations
ecg    [  59% ] 5 VUs  03m19.5s/30m0s  059/100 shared iters

running (03m23.0s), 5/5 VUs, 59 complete and 0 interrupted iterations
ecg    [  59% ] 5 VUs  03m20.5s/30m0s  059/100 shared iters

running (03m24.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
ecg    [  60% ] 5 VUs  03m21.5s/30m0s  060/100 shared iters

running (03m25.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
ecg    [  60% ] 5 VUs  03m22.5s/30m0s  060/100 shared iters

running (03m26.0s), 5/5 VUs, 61 complete and 0 interrupted iterations
ecg    [  61% ] 5 VUs  03m23.5s/30m0s  061/100 shared iters

running (03m27.0s), 5/5 VUs, 61 complete and 0 interrupted iterations
ecg    [  61% ] 5 VUs  03m24.5s/30m0s  061/100 shared iters

running (03m28.0s), 5/5 VUs, 61 complete and 0 interrupted iterations
ecg    [  61% ] 5 VUs  03m25.5s/30m0s  061/100 shared iters

running (03m29.0s), 5/5 VUs, 61 complete and 0 interrupted iterations
ecg    [  61% ] 5 VUs  03m26.5s/30m0s  061/100 shared iters

running (03m30.0s), 5/5 VUs, 62 complete and 0 interrupted iterations
ecg    [  62% ] 5 VUs  03m27.5s/30m0s  062/100 shared iters

running (03m31.0s), 5/5 VUs, 62 complete and 0 interrupted iterations
ecg    [  62% ] 5 VUs  03m28.5s/30m0s  062/100 shared iters

running (03m32.0s), 5/5 VUs, 63 complete and 0 interrupted iterations
ecg    [  63% ] 5 VUs  03m29.5s/30m0s  063/100 shared iters

running (03m33.0s), 5/5 VUs, 63 complete and 0 interrupted iterations
ecg    [  63% ] 5 VUs  03m30.5s/30m0s  063/100 shared iters

running (03m34.0s), 5/5 VUs, 63 complete and 0 interrupted iterations
ecg    [  63% ] 5 VUs  03m31.5s/30m0s  063/100 shared iters

running (03m35.0s), 5/5 VUs, 63 complete and 0 interrupted iterations
ecg    [  63% ] 5 VUs  03m32.5s/30m0s  063/100 shared iters

running (03m36.0s), 5/5 VUs, 64 complete and 0 interrupted iterations
ecg    [  64% ] 5 VUs  03m33.5s/30m0s  064/100 shared iters

running (03m37.0s), 5/5 VUs, 64 complete and 0 interrupted iterations
ecg    [  64% ] 5 VUs  03m34.5s/30m0s  064/100 shared iters

running (03m38.0s), 5/5 VUs, 64 complete and 0 interrupted iterations
ecg    [  64% ] 5 VUs  03m35.5s/30m0s  064/100 shared iters

running (03m39.0s), 5/5 VUs, 64 complete and 0 interrupted iterations
ecg    [  64% ] 5 VUs  03m36.5s/30m0s  064/100 shared iters

running (03m40.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
ecg    [  65% ] 5 VUs  03m37.5s/30m0s  065/100 shared iters

running (03m41.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
ecg    [  65% ] 5 VUs  03m38.5s/30m0s  065/100 shared iters

running (03m42.0s), 5/5 VUs, 66 complete and 0 interrupted iterations
ecg    [  66% ] 5 VUs  03m39.5s/30m0s  066/100 shared iters

running (03m43.0s), 5/5 VUs, 66 complete and 0 interrupted iterations
ecg    [  66% ] 5 VUs  03m40.5s/30m0s  066/100 shared iters

running (03m44.0s), 5/5 VUs, 66 complete and 0 interrupted iterations
ecg    [  66% ] 5 VUs  03m41.5s/30m0s  066/100 shared iters

running (03m45.0s), 5/5 VUs, 66 complete and 0 interrupted iterations
ecg    [  66% ] 5 VUs  03m42.5s/30m0s  066/100 shared iters

running (03m46.0s), 5/5 VUs, 67 complete and 0 interrupted iterations
ecg    [  67% ] 5 VUs  03m43.5s/30m0s  067/100 shared iters

running (03m47.0s), 5/5 VUs, 67 complete and 0 interrupted iterations
ecg    [  67% ] 5 VUs  03m44.5s/30m0s  067/100 shared iters

running (03m48.0s), 5/5 VUs, 67 complete and 0 interrupted iterations
ecg    [  67% ] 5 VUs  03m45.5s/30m0s  067/100 shared iters

running (03m49.0s), 5/5 VUs, 67 complete and 0 interrupted iterations
ecg    [  67% ] 5 VUs  03m46.5s/30m0s  067/100 shared iters

running (03m50.0s), 5/5 VUs, 68 complete and 0 interrupted iterations
ecg    [  68% ] 5 VUs  03m47.5s/30m0s  068/100 shared iters

running (03m51.0s), 5/5 VUs, 68 complete and 0 interrupted iterations
ecg    [  68% ] 5 VUs  03m48.5s/30m0s  068/100 shared iters

running (03m52.0s), 5/5 VUs, 69 complete and 0 interrupted iterations
ecg    [  69% ] 5 VUs  03m49.5s/30m0s  069/100 shared iters

running (03m53.0s), 5/5 VUs, 69 complete and 0 interrupted iterations
ecg    [  69% ] 5 VUs  03m50.5s/30m0s  069/100 shared iters

running (03m54.0s), 5/5 VUs, 69 complete and 0 interrupted iterations
ecg    [  69% ] 5 VUs  03m51.5s/30m0s  069/100 shared iters

running (03m55.0s), 5/5 VUs, 69 complete and 0 interrupted iterations
ecg    [  69% ] 5 VUs  03m52.5s/30m0s  069/100 shared iters

running (03m56.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
ecg    [  70% ] 5 VUs  03m53.5s/30m0s  070/100 shared iters

running (03m57.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
ecg    [  70% ] 5 VUs  03m54.5s/30m0s  070/100 shared iters

running (03m58.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
ecg    [  70% ] 5 VUs  03m55.5s/30m0s  070/100 shared iters

running (03m59.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
ecg    [  70% ] 5 VUs  03m56.5s/30m0s  070/100 shared iters

running (04m00.0s), 5/5 VUs, 71 complete and 0 interrupted iterations
ecg    [  71% ] 5 VUs  03m57.5s/30m0s  071/100 shared iters

running (04m01.0s), 5/5 VUs, 71 complete and 0 interrupted iterations
ecg    [  71% ] 5 VUs  03m58.5s/30m0s  071/100 shared iters

running (04m02.0s), 5/5 VUs, 71 complete and 0 interrupted iterations
ecg    [  71% ] 5 VUs  03m59.5s/30m0s  071/100 shared iters

running (04m03.0s), 5/5 VUs, 71 complete and 0 interrupted iterations
ecg    [  71% ] 5 VUs  04m00.5s/30m0s  071/100 shared iters

running (04m04.0s), 5/5 VUs, 72 complete and 0 interrupted iterations
ecg    [  72% ] 5 VUs  04m01.5s/30m0s  072/100 shared iters

running (04m05.0s), 5/5 VUs, 72 complete and 0 interrupted iterations
ecg    [  72% ] 5 VUs  04m02.5s/30m0s  072/100 shared iters

running (04m06.0s), 5/5 VUs, 72 complete and 0 interrupted iterations
ecg    [  72% ] 5 VUs  04m03.5s/30m0s  072/100 shared iters

running (04m07.0s), 5/5 VUs, 72 complete and 0 interrupted iterations
ecg    [  72% ] 5 VUs  04m04.5s/30m0s  072/100 shared iters

running (04m08.0s), 5/5 VUs, 73 complete and 0 interrupted iterations
ecg    [  73% ] 5 VUs  04m05.5s/30m0s  073/100 shared iters

running (04m09.0s), 5/5 VUs, 73 complete and 0 interrupted iterations
ecg    [  73% ] 5 VUs  04m06.5s/30m0s  073/100 shared iters

running (04m10.0s), 5/5 VUs, 74 complete and 0 interrupted iterations
ecg    [  74% ] 5 VUs  04m07.5s/30m0s  074/100 shared iters

running (04m11.0s), 5/5 VUs, 74 complete and 0 interrupted iterations
ecg    [  74% ] 5 VUs  04m08.5s/30m0s  074/100 shared iters

running (04m12.0s), 5/5 VUs, 74 complete and 0 interrupted iterations
ecg    [  74% ] 5 VUs  04m09.5s/30m0s  074/100 shared iters

running (04m13.0s), 5/5 VUs, 74 complete and 0 interrupted iterations
ecg    [  74% ] 5 VUs  04m10.5s/30m0s  074/100 shared iters

running (04m14.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
ecg    [  75% ] 5 VUs  04m11.5s/30m0s  075/100 shared iters

running (04m15.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
ecg    [  75% ] 5 VUs  04m12.5s/30m0s  075/100 shared iters

running (04m16.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
ecg    [  75% ] 5 VUs  04m13.5s/30m0s  075/100 shared iters

running (04m17.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
ecg    [  75% ] 5 VUs  04m14.5s/30m0s  075/100 shared iters

running (04m18.0s), 5/5 VUs, 76 complete and 0 interrupted iterations
ecg    [  76% ] 5 VUs  04m15.5s/30m0s  076/100 shared iters

running (04m19.0s), 5/5 VUs, 76 complete and 0 interrupted iterations
ecg    [  76% ] 5 VUs  04m16.5s/30m0s  076/100 shared iters

running (04m20.0s), 5/5 VUs, 76 complete and 0 interrupted iterations
ecg    [  76% ] 5 VUs  04m17.5s/30m0s  076/100 shared iters

running (04m21.0s), 5/5 VUs, 76 complete and 0 interrupted iterations
ecg    [  76% ] 5 VUs  04m18.5s/30m0s  076/100 shared iters

running (04m22.0s), 5/5 VUs, 77 complete and 0 interrupted iterations
ecg    [  77% ] 5 VUs  04m19.5s/30m0s  077/100 shared iters

running (04m23.0s), 5/5 VUs, 77 complete and 0 interrupted iterations
ecg    [  77% ] 5 VUs  04m20.5s/30m0s  077/100 shared iters

running (04m24.0s), 5/5 VUs, 77 complete and 0 interrupted iterations
ecg    [  77% ] 5 VUs  04m21.5s/30m0s  077/100 shared iters

running (04m25.0s), 5/5 VUs, 77 complete and 0 interrupted iterations
ecg    [  77% ] 5 VUs  04m22.5s/30m0s  077/100 shared iters

running (04m26.0s), 5/5 VUs, 78 complete and 0 interrupted iterations
ecg    [  78% ] 5 VUs  04m23.5s/30m0s  078/100 shared iters

running (04m27.0s), 5/5 VUs, 78 complete and 0 interrupted iterations
ecg    [  78% ] 5 VUs  04m24.5s/30m0s  078/100 shared iters

running (04m28.0s), 5/5 VUs, 78 complete and 0 interrupted iterations
ecg    [  78% ] 5 VUs  04m25.5s/30m0s  078/100 shared iters

running (04m29.0s), 5/5 VUs, 78 complete and 0 interrupted iterations
ecg    [  78% ] 5 VUs  04m26.5s/30m0s  078/100 shared iters

running (04m30.0s), 5/5 VUs, 79 complete and 0 interrupted iterations
ecg    [  79% ] 5 VUs  04m27.5s/30m0s  079/100 shared iters

running (04m31.0s), 5/5 VUs, 79 complete and 0 interrupted iterations
ecg    [  79% ] 5 VUs  04m28.5s/30m0s  079/100 shared iters

running (04m32.0s), 5/5 VUs, 79 complete and 0 interrupted iterations
ecg    [  79% ] 5 VUs  04m29.5s/30m0s  079/100 shared iters

running (04m33.0s), 5/5 VUs, 79 complete and 0 interrupted iterations
ecg    [  79% ] 5 VUs  04m30.5s/30m0s  079/100 shared iters

running (04m34.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
ecg    [  80% ] 5 VUs  04m31.5s/30m0s  080/100 shared iters

running (04m35.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
ecg    [  80% ] 5 VUs  04m32.5s/30m0s  080/100 shared iters

running (04m36.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
ecg    [  80% ] 5 VUs  04m33.5s/30m0s  080/100 shared iters

running (04m37.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
ecg    [  80% ] 5 VUs  04m34.5s/30m0s  080/100 shared iters

running (04m38.0s), 5/5 VUs, 81 complete and 0 interrupted iterations
ecg    [  81% ] 5 VUs  04m35.5s/30m0s  081/100 shared iters

running (04m39.0s), 5/5 VUs, 81 complete and 0 interrupted iterations
ecg    [  81% ] 5 VUs  04m36.5s/30m0s  081/100 shared iters

running (04m40.0s), 5/5 VUs, 81 complete and 0 interrupted iterations
ecg    [  81% ] 5 VUs  04m37.5s/30m0s  081/100 shared iters

running (04m41.0s), 5/5 VUs, 81 complete and 0 interrupted iterations
ecg    [  81% ] 5 VUs  04m38.5s/30m0s  081/100 shared iters

running (04m42.0s), 5/5 VUs, 82 complete and 0 interrupted iterations
ecg    [  82% ] 5 VUs  04m39.5s/30m0s  082/100 shared iters

running (04m43.0s), 5/5 VUs, 82 complete and 0 interrupted iterations
ecg    [  82% ] 5 VUs  04m40.5s/30m0s  082/100 shared iters

running (04m44.0s), 5/5 VUs, 83 complete and 0 interrupted iterations
ecg    [  83% ] 5 VUs  04m41.5s/30m0s  083/100 shared iters

running (04m45.0s), 5/5 VUs, 83 complete and 0 interrupted iterations
ecg    [  83% ] 5 VUs  04m42.5s/30m0s  083/100 shared iters

running (04m46.0s), 5/5 VUs, 83 complete and 0 interrupted iterations
ecg    [  83% ] 5 VUs  04m43.5s/30m0s  083/100 shared iters

running (04m47.0s), 5/5 VUs, 83 complete and 0 interrupted iterations
ecg    [  83% ] 5 VUs  04m44.5s/30m0s  083/100 shared iters

running (04m48.0s), 5/5 VUs, 84 complete and 0 interrupted iterations
ecg    [  84% ] 5 VUs  04m45.5s/30m0s  084/100 shared iters

running (04m49.0s), 5/5 VUs, 84 complete and 0 interrupted iterations
ecg    [  84% ] 5 VUs  04m46.5s/30m0s  084/100 shared iters

running (04m50.0s), 5/5 VUs, 84 complete and 0 interrupted iterations
ecg    [  84% ] 5 VUs  04m47.5s/30m0s  084/100 shared iters

running (04m51.0s), 5/5 VUs, 84 complete and 0 interrupted iterations
ecg    [  84% ] 5 VUs  04m48.5s/30m0s  084/100 shared iters

running (04m52.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
ecg    [  85% ] 5 VUs  04m49.5s/30m0s  085/100 shared iters

running (04m53.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
ecg    [  85% ] 5 VUs  04m50.5s/30m0s  085/100 shared iters

running (04m54.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
ecg    [  85% ] 5 VUs  04m51.5s/30m0s  085/100 shared iters

running (04m55.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
ecg    [  85% ] 5 VUs  04m52.5s/30m0s  085/100 shared iters

running (04m56.0s), 5/5 VUs, 86 complete and 0 interrupted iterations
ecg    [  86% ] 5 VUs  04m53.5s/30m0s  086/100 shared iters

running (04m57.0s), 5/5 VUs, 86 complete and 0 interrupted iterations
ecg    [  86% ] 5 VUs  04m54.5s/30m0s  086/100 shared iters

running (04m58.0s), 5/5 VUs, 86 complete and 0 interrupted iterations
ecg    [  86% ] 5 VUs  04m55.5s/30m0s  086/100 shared iters

running (04m59.0s), 5/5 VUs, 86 complete and 0 interrupted iterations
ecg    [  86% ] 5 VUs  04m56.5s/30m0s  086/100 shared iters

running (05m00.0s), 5/5 VUs, 87 complete and 0 interrupted iterations
ecg    [  87% ] 5 VUs  04m57.5s/30m0s  087/100 shared iters

running (05m01.0s), 5/5 VUs, 87 complete and 0 interrupted iterations
ecg    [  87% ] 5 VUs  04m58.5s/30m0s  087/100 shared iters

running (05m02.0s), 5/5 VUs, 87 complete and 0 interrupted iterations
ecg    [  87% ] 5 VUs  04m59.5s/30m0s  087/100 shared iters

running (05m03.0s), 5/5 VUs, 87 complete and 0 interrupted iterations
ecg    [  87% ] 5 VUs  05m00.5s/30m0s  087/100 shared iters

running (05m04.0s), 5/5 VUs, 88 complete and 0 interrupted iterations
ecg    [  88% ] 5 VUs  05m01.5s/30m0s  088/100 shared iters

running (05m05.0s), 5/5 VUs, 88 complete and 0 interrupted iterations
ecg    [  88% ] 5 VUs  05m02.5s/30m0s  088/100 shared iters

running (05m06.0s), 5/5 VUs, 88 complete and 0 interrupted iterations
ecg    [  88% ] 5 VUs  05m03.5s/30m0s  088/100 shared iters

running (05m07.0s), 5/5 VUs, 88 complete and 0 interrupted iterations
ecg    [  88% ] 5 VUs  05m04.5s/30m0s  088/100 shared iters

running (05m08.0s), 5/5 VUs, 89 complete and 0 interrupted iterations
ecg    [  89% ] 5 VUs  05m05.5s/30m0s  089/100 shared iters

running (05m09.0s), 5/5 VUs, 89 complete and 0 interrupted iterations
ecg    [  89% ] 5 VUs  05m06.5s/30m0s  089/100 shared iters

running (05m10.0s), 5/5 VUs, 89 complete and 0 interrupted iterations
ecg    [  89% ] 5 VUs  05m07.5s/30m0s  089/100 shared iters

running (05m11.0s), 5/5 VUs, 89 complete and 0 interrupted iterations
ecg    [  89% ] 5 VUs  05m08.5s/30m0s  089/100 shared iters

running (05m12.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
ecg    [  90% ] 5 VUs  05m09.5s/30m0s  090/100 shared iters

running (05m13.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
ecg    [  90% ] 5 VUs  05m10.5s/30m0s  090/100 shared iters

running (05m14.0s), 5/5 VUs, 91 complete and 0 interrupted iterations
ecg    [  91% ] 5 VUs  05m11.5s/30m0s  091/100 shared iters

running (05m15.0s), 5/5 VUs, 91 complete and 0 interrupted iterations
ecg    [  91% ] 5 VUs  05m12.5s/30m0s  091/100 shared iters

running (05m16.0s), 5/5 VUs, 91 complete and 0 interrupted iterations
ecg    [  91% ] 5 VUs  05m13.5s/30m0s  091/100 shared iters

running (05m17.0s), 5/5 VUs, 91 complete and 0 interrupted iterations
ecg    [  91% ] 5 VUs  05m14.5s/30m0s  091/100 shared iters

running (05m18.0s), 5/5 VUs, 92 complete and 0 interrupted iterations
ecg    [  92% ] 5 VUs  05m15.5s/30m0s  092/100 shared iters

running (05m19.0s), 5/5 VUs, 92 complete and 0 interrupted iterations
ecg    [  92% ] 5 VUs  05m16.5s/30m0s  092/100 shared iters

running (05m20.0s), 5/5 VUs, 92 complete and 0 interrupted iterations
ecg    [  92% ] 5 VUs  05m17.5s/30m0s  092/100 shared iters

running (05m21.0s), 5/5 VUs, 92 complete and 0 interrupted iterations
ecg    [  92% ] 5 VUs  05m18.5s/30m0s  092/100 shared iters

running (05m22.0s), 5/5 VUs, 93 complete and 0 interrupted iterations
ecg    [  93% ] 5 VUs  05m19.5s/30m0s  093/100 shared iters

running (05m23.0s), 5/5 VUs, 93 complete and 0 interrupted iterations
ecg    [  93% ] 5 VUs  05m20.5s/30m0s  093/100 shared iters

running (05m24.0s), 5/5 VUs, 94 complete and 0 interrupted iterations
ecg    [  94% ] 5 VUs  05m21.5s/30m0s  094/100 shared iters

running (05m25.0s), 5/5 VUs, 94 complete and 0 interrupted iterations
ecg    [  94% ] 5 VUs  05m22.5s/30m0s  094/100 shared iters

running (05m26.0s), 5/5 VUs, 94 complete and 0 interrupted iterations
ecg    [  94% ] 5 VUs  05m23.5s/30m0s  094/100 shared iters

running (05m27.0s), 5/5 VUs, 94 complete and 0 interrupted iterations
ecg    [  94% ] 5 VUs  05m24.5s/30m0s  094/100 shared iters

running (05m28.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
ecg    [  95% ] 5 VUs  05m25.5s/30m0s  095/100 shared iters

running (05m29.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
ecg    [  95% ] 5 VUs  05m26.5s/30m0s  095/100 shared iters

running (05m30.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
ecg    [  95% ] 5 VUs  05m27.5s/30m0s  095/100 shared iters

running (05m31.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
ecg    [  95% ] 5 VUs  05m28.5s/30m0s  095/100 shared iters

running (05m32.0s), 4/5 VUs, 96 complete and 0 interrupted iterations
ecg    [  96% ] 5 VUs  05m29.5s/30m0s  096/100 shared iters

running (05m33.0s), 4/5 VUs, 96 complete and 0 interrupted iterations
ecg    [  96% ] 5 VUs  05m30.5s/30m0s  096/100 shared iters

running (05m34.0s), 3/5 VUs, 97 complete and 0 interrupted iterations
ecg    [  97% ] 5 VUs  05m31.5s/30m0s  097/100 shared iters

running (05m35.0s), 3/5 VUs, 97 complete and 0 interrupted iterations
ecg    [  97% ] 5 VUs  05m32.5s/30m0s  097/100 shared iters

running (05m36.0s), 3/5 VUs, 97 complete and 0 interrupted iterations
ecg    [  97% ] 5 VUs  05m33.5s/30m0s  097/100 shared iters

running (05m37.0s), 3/5 VUs, 97 complete and 0 interrupted iterations
ecg    [  97% ] 5 VUs  05m34.5s/30m0s  097/100 shared iters

running (05m38.0s), 2/5 VUs, 98 complete and 0 interrupted iterations
ecg    [  98% ] 5 VUs  05m35.5s/30m0s  098/100 shared iters

running (05m39.0s), 2/5 VUs, 98 complete and 0 interrupted iterations
ecg    [  98% ] 5 VUs  05m36.5s/30m0s  098/100 shared iters

running (05m40.0s), 2/5 VUs, 98 complete and 0 interrupted iterations
ecg    [  98% ] 5 VUs  05m37.5s/30m0s  098/100 shared iters

running (05m41.0s), 2/5 VUs, 98 complete and 0 interrupted iterations
ecg    [  98% ] 5 VUs  05m38.5s/30m0s  098/100 shared iters

running (05m42.0s), 1/5 VUs, 99 complete and 0 interrupted iterations
ecg    [  99% ] 5 VUs  05m39.5s/30m0s  099/100 shared iters

running (05m43.0s), 1/5 VUs, 99 complete and 0 interrupted iterations
ecg    [  99% ] 5 VUs  05m40.5s/30m0s  099/100 shared iters


  █ THRESHOLDS 

    ecg_duration
    ✓ 'p(95)<30000' p(95)=20.04s

    ecg_success
    ✓ 'rate>0.95' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 200     0.582139/s
    checks_succeeded...: 100.00% 200 out of 200
    checks_failed......: 0.00%   0 out of 200

    ✓ ecg completed
    ✓ ecg under 30s

    CUSTOM
    ecg_duration...................: avg=16.74s min=10.03s med=16.04s max=22.05s   p(90)=18.05s p(95)=20.04s
    ecg_success....................: 100.00% 100 out of 100

    HTTP
    http_req_duration..............: avg=7.06ms min=1.31ms med=3.98ms max=256.37ms p(90)=7.8ms  p(95)=9.15ms
      { expected_response:true }...: avg=7.06ms min=1.31ms med=3.98ms max=256.37ms p(90)=7.8ms  p(95)=9.15ms
    http_req_failed................: 0.00%   0 out of 945
    http_reqs......................: 945     2.750608/s

    EXECUTION
    iteration_duration.............: avg=16.75s min=10.04s med=16.05s max=22.09s   p(90)=18.06s p(95)=20.05s
    iterations.....................: 100     0.29107/s
    vus............................: 1       min=0          max=5
    vus_max........................: 5       min=5          max=5

    NETWORK
    data_received..................: 1.4 MB  4.2 kB/s
    data_sent......................: 2.7 MB  7.9 kB/s



running (05m43.6s), 0/5 VUs, 100 complete and 0 interrupted iterations
ecg  ✓ [ 100% ] 5 VUs  05m41.1s/30m0s  100/100 shared iters
time="2026-06-17T07:53:03Z" level=error msg="failed to handle the end-of-test summary" error="Could not save some summary information:\n\t- could not open '/tests/results/20260617_104413_capacity_working_summary.json': open /tests/results/20260617_104413_capacity_working_summary.json: permission denied"